In [2]:
import numpy as np
import pandas as pd

In [10]:
df = pd.read_csv('titanic_md.csv')

In [11]:
print('Titanic modificado:', df.shape)

df.head()

Titanic modificado: (183, 12)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",?,38.0,1.0,0.0,PC 17599,71.2833,C85,C
1,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
2,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0.0,0.0,17463,51.8625,E46,S
3,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,NaN,1.0,NaN,PP 9549,16.7000,G6,S
4,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,NaN,0.0,113783,26.5500,C103,S

In [12]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,183.000000,183.000000,183.000000,158.000000,180.000000,171.000000,175.000000
mean,455.366120,0.672131,1.191257,35.692532,0.461111,0.461988,78.959191
std,247.052476,0.470725,0.515187,15.640858,0.646122,0.753435,77.026328
min,2.000000,0.000000,1.000000,0.920000,0.000000,0.000000,0.000000
25%,263.500000,0.000000,1.000000,24.000000,0.000000,0.000000,29.700000
50%,457.000000,1.000000,1.000000,35.500000,0.000000,0.000000,56.929200
75%,676.000000,1.000000,1.000000,48.000000,1.000000,1.000000,90.539600
max,890.000000,1.000000,3.000000,80.000000,3.000000,4.000000,512.329200

In [13]:
df.isna().sum()

PassengerId     0
Survived        0
Pclass          0
Name            0
Sex             0
Age            25
SibSp           3
Parch          12
Ticket          0
Fare            8
Cabin           0
Embarked       12
dtype: int64

In [14]:
np.unique(df['PassengerId'])

array([  2,   4,   7,  11,  12,  22,  24,  28,  53,  55,  63,  67,  76,
        89,  93,  97,  98, 103, 111, 119, 124, 125, 137, 138, 140, 149,
       152, 171, 175, 178, 184, 194, 195, 196, 206, 210, 216, 219, 225,
       231, 246, 249, 252, 253, 258, 263, 264, 269, 270, 274, 276, 292,
       293, 298, 300, 306, 308, 310, 311, 312, 319, 320, 326, 328, 330,
       332, 333, 337, 338, 340, 341, 342, 346, 357, 367, 370, 371, 378,
       391, 394, 395, 413, 430, 431, 435, 436, 439, 446, 450, 453, 454,
       457, 461, 463, 474, 485, 487, 488, 493, 497, 499, 505, 506, 513,
       516, 517, 521, 524, 537, 540, 541, 545, 551, 557, 559, 572, 573,
       578, 582, 584, 586, 588, 592, 600, 610, 619, 622, 626, 628, 631,
       633, 642, 646, 648, 660, 663, 672, 680, 682, 690, 691, 699, 700,
       701, 702, 708, 711, 713, 716, 717, 718, 725, 731, 738, 742, 743,
       746, 749, 752, 760, 764, 766, 773, 780, 782, 783, 790, 797, 803,
       807, 810, 821, 824, 836, 854, 858, 863, 868, 872, 873, 880, 888,
       890], dtype=int64)

In [23]:
np.unique(df['Survived'])

array([0, 1], dtype=int64)

In [24]:
np.unique(df['Pclass'])

array([1, 2, 3], dtype=int64)

In [25]:
np.unique(df['Name'])

array(['Allen, Miss. Elisabeth Walton', 'Allison, Master. Hudson Trevor',
       'Allison, Miss. Helen Loraine',
       'Allison, Mrs. Hudson J C (Bessie Waldo Daniels)',
       'Anderson, Mr. Harry', 'Andrews, Miss. Kornelia Theodosia',
       'Andrews, Mr. Thomas Jr',
       'Appleton, Mrs. Edward Dale (Charlotte Lamson)',
       'Astor, Mrs. John Jacob (Madeleine Talmadge Force)',
       'Aubart, Mme. Leontine Pauline', 'Ball, Mrs. (Ada E Hall)',
       'Barkworth, Mr. Algernon Henry Wilson', 'Baxter, Mr. Quigg Edmond',
       'Baxter, Mrs. James (Helene DeLaudeniere Chaput)',
       'Bazzani, Miss. Albina', 'Becker, Master. Richard F',
       'Becker, Miss. Marion Louise', 'Beckwith, Mr. Richard Leonard',
       'Beckwith, Mrs. Richard Leonard (Sallie Monypeny)',
       'Beesley, Mr. Lawrence', 'Behr, Mr. Karl Howell',
       'Bishop, Mr. Dickinson H',
       'Bishop, Mrs. Dickinson H (Helen Walton)',
       'Bissette, Miss. Amelia',
       'Bjornstrom-Steffansson, Mr. Mauritz Hakan',
       'Blackwell, Mr. Stephen Weart', 'Blank, Mr. Henry',
       'Bonnell, Miss. Elizabeth', 'Bowerman, Miss. Elsie Edith',
       'Brown, Miss. Amelia "Mildred"',
       'Brown, Mrs. James Joseph (Margaret Tobin)',
       'Burns, Miss. Elizabeth Margaret',
       'Butt, Major. Archibald Willingham',
       'Calderhead, Mr. Edward Pennington',
       'Cardeza, Mr. Thomas Drake Martinez', 'Carlsson, Mr. Frans Olof',
       'Carter, Master. William Thornton II', 'Carter, Miss. Lucile Polk',
       'Carter, Mr. William Ernest',
       'Carter, Mrs. William Ernest (Lucile Polk)',
       'Cavendish, Mr. Tyrell William', 'Chaffee, Mr. Herbert Fuller',
       'Chambers, Mr. Norman Campbell',
       'Chambers, Mrs. Norman Campbell (Bertha Griggs)',
       'Cherry, Miss. Gladys', 'Colley, Mr. Edward Pomeroy',
       'Compton, Miss. Sara Rebecca', 'Crosby, Capt. Edward Gifford',
       'Crosby, Miss. Harriet R',
       'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
       'Daly, Mr. Peter Denis ', 'Davidson, Mr. Thornton',
       'Dick, Mr. Albert Adrian',
       'Dick, Mrs. Albert Adrian (Vera Gillespie)',
       'Dodge, Master. Washington', 'Douglas, Mr. Walter Donald',
       'Duff Gordon, Lady. (Lucille Christiana Sutherland) ("Mrs Morgan")',
       'Duff Gordon, Sir. Cosmo Edmund ("Mr Morgan")',
       'Endres, Miss. Caroline Louise', 'Eustis, Miss. Elizabeth Mussey',
       'Flynn, Mr. John Irwin ("Irving")',
       'Foreman, Mr. Benjamin Laventall',
       'Fortune, Miss. Alice Elizabeth', 'Fortune, Miss. Mabel Helen',
       'Fortune, Mr. Charles Alexander', 'Fortune, Mr. Mark',
       'Francatelli, Miss. Laura Mabel',
       'Frolicher, Miss. Hedwig Margaritha',
       'Frolicher-Stehli, Mr. Maxmillian', 'Futrelle, Mr. Jacques Heath',
       'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
       'Gee, Mr. Arthur H', 'Giglio, Mr. Victor',
       'Goldenberg, Mr. Samuel L', 'Goldschmidt, Mr. George B',
       'Graham, Miss. Margaret Edith', 'Graham, Mr. George Edward',
       'Graham, Mrs. William Thompson (Edith Junkins)',
       'Greenfield, Mr. William Bertram', 'Guggenheim, Mr. Benjamin',
       'Harder, Mr. George Achilles', 'Harper, Mr. Henry Sleeper',
       'Harper, Mrs. Henry Sleeper (Myna Haxtun)',
       'Harris, Mr. Henry Birkhardt',
       'Harris, Mrs. Henry Birkhardt (Irene Wallach)',
       'Harrison, Mr. William', 'Hassab, Mr. Hammad',
       'Hays, Miss. Margaret Bechstein',
       'Hays, Mrs. Charles Melville (Clara Jennings Gregg)',
       'Hippach, Miss. Jean Gertrude',
       'Hippach, Mrs. Louis Albert (Ida Sophia Fischer)',
       'Hogeboom, Mrs. John C (Anna Andrews)',
       'Hoyt, Mr. Frederick Maxfield',
       'Hoyt, Mrs. Frederick Maxfield (Jane Anne Forby)',
       'Humblen, Mr. Adolf Mathias Nicolai Olsen',
       'Isham, Miss. Ann Elizabeth',
       'Jerwan, Mrs. Amin S (Marie Marthe Thuillard)',
       'Kent, Mr. Edward Austin', 'Kimball, Mr. Edwin Nelson Jr',
       'Leader, Dr. Alice (Farnham)', 'Lemore, Mrs. (Amelia Milley)',
       'Lesurer, Mr. Gustave J', 'Levy, Mr. Rene Jacques',
       'Lines, Miss. Mary Conover', 'Long, Mr. Milton Clyde',
       'Longley, Miss. Gretchen Fiske', 'Lurette, Miss. Elise',
       'Mack, Mrs. (Mary)', 'Madill, Miss. Georgette Alexandra',
       'Maioni, Miss. Roberta', 'Marvin, Mr. Daniel Warner',
       'Mayne, Mlle. Berthe Antonine ("Mrs de Villiers")',
       'McCarthy, Mr. Timothy J', 'McGough, Mr. James Robert',
       'Millet, Mr. Francis Davis', 'Minahan, Dr. William Edward',
       'Minahan, Miss. Daisy E', 'Moen, Mr. Sigurd Hansen',
       'Molson, Mr. Harry Markland', 'Moor, Master. Meier',
       'Moor, Mrs. (Beila)', 'Natsch, Mr. Charles H',
       'Navratil, Master. Edmond Roger', 'Navratil, Master. Michel M',
       'Navratil, Mr. Michel ("Louis M Hoffman")',
       'Newell, Miss. Madeleine', 'Newell, Miss. Marjorie',
       'Newell, Mr. Arthur Webster', 'Newsom, Miss. Helen Monypeny',
       'Nye, Mrs. (Elizabeth Ramell)', 'Ostby, Mr. Engelhart Cornelius',
       'Partner, Mr. Austen', 'Pears, Mr. Thomas Clinton',
       'Pears, Mrs. Thomas (Edith Wearne)',
       'Penasco y Castellana, Mr. Victor de Satode',
       'Penasco y Castellana, Mrs. Victor de Satode (Maria Josefa Perez de Soto y Vallejo)',
       'Perreault, Miss. Anne', 'Peuchen, Major. Arthur Godfrey',
       'Pickard, Mr. Berk (Berk Trembisky)',
       'Porter, Mr. Walter Chamberlain',
       'Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)',
       'Robert, Mrs. Edward Scott (Elisabeth Walton McMillan)',
       'Roebling, Mr. Washington Augustus II', 'Ross, Mr. John Hugo',
       'Rothes, the Countess. of (Lucy Noel Martha Dyer-Edwards)',
       'Ryerson, Miss. Emily Borie',
       'Ryerson, Miss. Susan Parker "Suzette"', 'Sagesser, Mlle. Emma',
       'Sandstrom, Miss. Marguerite Rut',
       'Sandstrom, Mrs. Hjalmar (Agnes Charlotta Bengtsson)',
       'Shutes, Miss. Elizabeth W', 'Silverthorne, Mr. Spencer Victor',
       'Silvey, Mr. William Baird',
       'Silvey, Mrs. William Baird (Alice Munger)',
       'Simonius-Blumer, Col. Oberst Alfons',
       'Sloper, Mr. William Thompson', 'Smith, Mr. James Clinch',
       'Soholt, Mr. Peter Andreas Lauritz Andersen',
       'Spedden, Mrs. Frederic Oakley (Margaretta Corning Stone)',
       'Stahelin-Maeglin, Dr. Max', 'Stead, Mr. William Thomas',
       'Stephenson, Mrs. Walter Bertram (Martha Eustis)',
       'Strom, Miss. Telma Matilda',
       'Strom, Mrs. Wilhelm (Elna Matilda Persson)',
       'Sutton, Mr. Frederick',
       'Swift, Mrs. Frederick Joel (Margaret Welles Barron)',
       'Taussig, Miss. Ruth', 'Taussig, Mr. Emil',
       'Taussig, Mrs. Emil (Tillie Mandelbaum)',
       'Taylor, Mr. Elmer Zebley', 'Thayer, Mr. John Borland',
       'Thayer, Mr. John Borland Jr',
       'Thayer, Mrs. John Borland (Marian Longstreth Morris)',
       'Troutt, Miss. Edwina Celia "Winnie"', 'Van der hoef, Mr. Wyckoff',
       'Walker, Mr. William Anderson',
       'Warren, Mrs. Frank Manley (Anna Sophia Atkinson)',
       'Webber, Miss. Susan', 'White, Mr. Percival Wayland',
       'White, Mr. Richard Frasar', 'Wick, Miss. Mary Natalie',
       'Widener, Mr. Harry Elkins', 'Young, Miss. Marie Grice'],
      dtype=object)

In [26]:
np.unique(df['Sex'])

array(['?', 'female', 'male'], dtype=object)

In [68]:
np.unique(df['Age'])

array([ 0.92,  2.  ,  3.  ,  4.  ,  6.  , 11.  , 14.  , 15.  , 16.  ,
       17.  , 18.  , 19.  , 21.  , 22.  , 23.  , 24.  , 25.  , 27.  ,
       28.  , 29.  , 30.  , 31.  , 32.  , 33.  , 34.  , 35.  , 36.  ,
       36.5 , 37.  , 38.  , 39.  , 40.  , 41.  , 42.  , 43.  , 44.  ,
       45.  , 46.  , 47.  , 48.  , 49.  , 50.  , 51.  , 52.  , 53.  ,
       54.  , 55.  , 56.  , 58.  , 60.  , 61.  , 62.  , 63.  , 64.  ,
       65.  , 70.  , 71.  , 80.  ,   nan])

In [67]:
np.unique(df['SibSp'])

array([ 0.,  1.,  2.,  3., nan])

In [66]:
np.unique(df['Ticket'])

array(['110152', '110413', '110465', '110564', '110813', '111240',
       '111320', '111361', '111369', '112050', '112053', '112059',
       '112277', '113043', '113050', '113051', '113055', '113501',
       '113503', '113505', '113509', '113514', '113760', '113773',
       '113776', '113781', '113783', '113784', '113786', '113787',
       '113788', '113803', '113806', '11751', '11752', '11753', '11755',
       '11765', '11767', '11769', '11771', '11813', '11967', '12749',
       '13049', '13213', '13214', '13502', '13507', '13509', '13567',
       '13568', '16966', '17421', '17453', '17463', '17465', '17466',
       '17474', '17764', '19877', '19928', '19943', '19950', '19952',
       '19996', '230080', '230136', '24160', '248698', '248733', '27042',
       '27267', '28551', '33638', '34218', '347054', '348121', '348123',
       '348124', '35273', '35281', '36928', '36947', '36963', '36967',
       '36973', '392096', '5727', '695', 'C.A. 29395', 'C.A. 34260',
       'F.C. 12750', 'PC 17473', 'PC 17474', 'PC 17475', 'PC 17476',
       'PC 17477', 'PC 17482', 'PC 17485', 'PC 17558', 'PC 17569',
       'PC 17572', 'PC 17582', 'PC 17590', 'PC 17592', 'PC 17593',
       'PC 17595', 'PC 17596', 'PC 17599', 'PC 17608', 'PC 17610',
       'PC 17754', 'PC 17755', 'PC 17756', 'PC 17757', 'PC 17758',
       'PC 17759', 'PC 17760', 'PC 17761', 'PP 9549', 'S.O./P.P. 3',
       'SC/AH Basle 541', 'SC/Paris 2163', 'SOTON/O.Q. 392078',
       'W.E.P. 5734', 'WE/P 5735'], dtype=object)

In [65]:
np.unique(df['Fare'])

array([  0.    ,   5.    ,   7.65  ,   8.05  ,  10.4625,  10.5   ,
        12.475 ,  12.875 ,  13.    ,  13.7917,  16.7   ,  25.5875,
        25.9292,  26.    ,  26.2833,  26.2875,  26.3875,  26.55  ,
        27.7208,  27.75  ,  28.5   ,  28.7125,  29.7   ,  30.    ,
        30.5   ,  30.6958,  31.    ,  32.3208,  33.5   ,  34.0208,
        34.6542,  35.5   ,  38.5   ,  39.    ,  39.4   ,  39.6   ,
        40.125 ,  49.5   ,  49.5042,  50.4958,  51.4792,  51.8625,
        52.    ,  52.5542,  53.1   ,  55.    ,  55.4417,  55.9   ,
        56.9292,  57.    ,  57.9792,  61.175 ,  61.9792,  63.3583,
        66.6   ,  69.3   ,  71.    ,  71.2833,  75.25  ,  76.7292,
        77.2875,  77.9583,  78.2667,  78.85  ,  79.2   ,  79.65  ,
        81.8583,  83.1583,  83.475 ,  86.5   ,  89.1042,  90.    ,
        91.0792,  93.5   , 106.425 , 108.9   , 110.8833, 113.275 ,
       120.    , 134.5   , 135.6333, 146.5208, 151.55  , 153.4625,
       164.8667, 211.3375, 211.5   , 227.525 , 247.5208, 262.375 ,
       263.    , 512.3292,      nan])

In [64]:
np.unique(df['Cabin'])

array(['A10', 'A16', 'A20', 'A23', 'A24', 'A26', 'A31', 'A34', 'A36',
       'A5', 'A6', 'A7', 'B101', 'B18', 'B19', 'B20', 'B22', 'B3', 'B30',
       'B35', 'B37', 'B38', 'B39', 'B4', 'B41', 'B42', 'B49', 'B5', 'B50',
       'B51 B53 B55', 'B57 B59 B63 B66', 'B58 B60', 'B69', 'B71', 'B73',
       'B77', 'B79', 'B80', 'B82 B84', 'B86', 'B94', 'B96 B98', 'C101',
       'C103', 'C104', 'C110', 'C111', 'C118', 'C123', 'C124', 'C125',
       'C126', 'C148', 'C2', 'C22 C26', 'C23 C25 C27', 'C30', 'C32',
       'C45', 'C46', 'C49', 'C50', 'C52', 'C54', 'C62 C64', 'C65', 'C68',
       'C7', 'C70', 'C78', 'C82', 'C83', 'C85', 'C86', 'C87', 'C90',
       'C91', 'C92', 'C93', 'C99', 'D', 'D10 D12', 'D11', 'D15', 'D17',
       'D19', 'D20', 'D26', 'D28', 'D30', 'D33', 'D35', 'D36', 'D37',
       'D46', 'D47', 'D48', 'D49', 'D50', 'D56', 'D6', 'D7', 'D9', 'E10',
       'E101', 'E12', 'E121', 'E17', 'E24', 'E25', 'E31', 'E33', 'E34',
       'E36', 'E38', 'E40', 'E44', 'E46', 'E49', 'E50', 'E58', 'E63',
       'E67', 'E68', 'E77', 'E8', 'F G63', 'F G73', 'F2', 'F33', 'F4',
       'G6', 'T'], dtype=object)

In [60]:
df['Embarked'].unique()

array(['C', 'S', nan, 'Q'], dtype=object)

In [71]:
cols = []
val = []
for col in df.select_dtypes(include='object').columns:
    cols.append(col)
    val.append(df[col].str.contains(r'\?').sum())
pd.DataFrame({
    'cols':cols,
    'val':val
})

       cols  val
0      Name    0
1       Sex    0
2    Ticket    0
3     Cabin    0
4  Embarked    0

In [70]:
df.replace(r'\?', np.nan, regex = True, inplace = True)

In [72]:
df.isna().sum()

PassengerId     0
Survived        0
Pclass          0
Name            0
Sex            51
Age            25
SibSp           3
Parch          12
Ticket          0
Fare            8
Cabin           0
Embarked       12
dtype: int64

In [75]:
print("Filas totales: ",df.shape[0])
print("Filas completas: ",df.dropna().shape[0])

Filas totales:  183
Filas completas:  100